Revit 2026 API

# ConnectorElectricalSystemType Property

---

The electrical system type of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElectricalSystemType ElectricalSystemType { get; }
```
```vb
Public ReadOnly Property ElectricalSystemType As ElectricalSystemType
	Get
```
```cpp
public:
property ElectricalSystemType ElectricalSystemType {
	ElectricalSystemType get ();
}
```
```fsharp
member ElectricalSystemType : ElectricalSystemType with get
```

#### Property Value

ElectricalSystemType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's domain is not of DomainElectrical. |
| InvalidOperationException | Thrown on failure to get electrical system type. |

Instantaneous system type at this connector, calculated according to system. For unconnected connectors, system type is undefined.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace